Repository: gnsiliksiz/react-native-passport-id-nfc-reader
Catalog: ios/Localizables/*.lproj/Localizable.strings
Languages: ar, fr, ru, tr

# NFCDisplayMessageStrings_NearNFC
source: Hold your iPhone near an NFC enabled passport.
ar: احمل جهاز iPhone بالقرب من جواز سفر مزود بتقنية NFC.
fr: Tenez votre iPhone près d'un passeport compatible NFC.
ru: Держите iPhone рядом с паспортом с поддержкой NFC.
tr: iPhone'unuzu NFC özellikli bir kimlik/pasaport yakınında tutun

# NFCDisplayMessageStrings_Authenticating
source: Authenticating
ar: المصادقة
fr: Authentification
ru: Аутентификация
tr: Kimlik Doğrulama

# NFCDisplayMessageStrings_Reading
source: Reading
ar: قراءة
fr: En lisant
ru: чтение
tr: Okuma

# NFCDisplayMessageStrings_TagNoValid
source: Tag not valid
ar: العلامة غير صالحة
fr: Balise non valide
ru: Тег недействителен
tr: Etiket geçerli değil

# NFCDisplayMessageStrings_OneTagFound
source: More than 1 tags was found. Please present only 1 tag.
ar: تم العثور على أكثر من علامة واحدة. يرجى إظهار علامة واحدة فقط.
fr: Plusieurs balises trouvées. Veuillez n'afficher qu'un seul tag.
ru: Найдено более одного тега. Пожалуйста, покажите только один тег.
tr: Birden fazla etiket bulundu. Lütfen sadece bir etiket gösterin

# NFCDisplayMessageStrings_ConnectionError
source: Connection error. Please try again.
ar: خطأ في الإتصال. حاول مرة اخرى.
fr: Erreur de connexion. Veuillez réessayer.
ru: Ошибка подключения. Пожалуйста, попробуйте еще раз.
tr: Bağlantı hatası. Lütfen tekrar deneyin.

# NFCDisplayMessageStrings_MRZKeyNotValid
source: MRZ Key Not Valid.
ar: MRZ Key غير صالح لهذا المستند.
fr: La clé MRZ n'est pas valide pour ce document.
ru: Ключ MRZ недействителен для этого документа.
tr: MRZ Anahtarı bu belge için geçerli değil

# NFCDisplayMessageStrings_ProblemReading
source: Sorry, there was a problem reading the.
ar: عذراً، كانت هناك مشكلة في قراءة الـ.
fr: Désolé, un problème est survenu lors de la lecture du
ru: Извините, возникла проблема с чтением.
tr: Üzgünüz, okumada bir sorun oluştu.

# NFCDisplayMessageStrings_TryAgainProblemReading
source: Sorry, there was a problem reading the. Please try again.
ar: عذراً، كانت هناك مشكلة في قراءة الـ. حاول مرة اخرى.
fr: Désolé, un problème est survenu lors de la lecture Veuillez réessayer.
ru: Извините, возникла проблема с чтением. Пожалуйста, попробуйте еще раз.
tr: Üzgünüz, okumada bir sorun oluştu. Lütfen tekrar deneyin

# NFCDisplayMessageStrings_ReadSuccessfully
source: Successfully read
ar: اقرأ بنجاح
fr: Lu avec succès
ru: Успешно прочитано
tr: Başarıyla okundu

# NFCDisplayMessageStrings_InvalidResponse
source: Invalid Response
ar: جواب غير صالح
fr: Réponse invalide
ru: Неверный ответ
tr: Geçersiz cevap

# NFCDisplayMessageStrings_UnexpectedError
source: Unexpected Error
ar: خطأ غير متوقع
fr: Erreur inattendue
ru: Неожиданная ошибка
tr: Beklenmeyen hata

# NFCDisplayMessageStrings_NFCNotSupported
source: NFC Not Supported
ar: NFC غير مدعوم
fr: NFC non pris en charge
ru: NFC не поддерживается
tr: NFC Desteklenmiyor

# NFCDisplayMessageStrings_NoConnectedTag
source: No Connected Tag
ar: لا توجد علامات مرفقة
fr: Balise non connectée
ru: Не подключенный тег
tr: Bağlı Etiket Yok

# NFCDisplayMessageStrings_D087Malformed
source: D087 Malformed
ar: D087 مشوه
fr: D087 Malformé
ru: D087 Деформированный
tr: D087 Hatalı biçimlendirilmiş

# NFCDisplayMessageStrings_InvalidResponseChecksum
source: Invalid Response Checksum
ar: المجموع الاختباري للاستجابة غير صالح
fr: Somme de contrôle de réponse invalide
ru: Неверная контрольная сумма ответа
tr: Geçersiz Yanıt Sağlama Toplamı

# NFCDisplayMessageStrings_MissingMandatoryFields
source: Missing Mandatory Fields
ar: الحقول المطلوبة مفقودة
fr: Champs obligatoires manquants
ru: Отсутствуют обязательные поля
tr: Eksik Zorunlu Alanlar

# NFCDisplayMessageStrings_CannotDecodeASN1Length
source: Cannot Decode ASN1 Length
ar: لا يمكن فك تشفير طول ASN1
fr: Impossible de décoder la longueur ASN1
ru: Невозможно декодировать длину ASN1
tr: ASN1 Uzunluğunun Kodu Çözülemiyor

# NFCDisplayMessageStrings_InvalidASN1Value
source: Invalid ASN1 Value
ar: قيمة ASN1 غير صالحة
fr: Valeur ASN1 invalide
ru: Недопустимое значение ASN1
tr: Geçersiz ASN1 Değeri

# NFCDisplayMessageStrings_UnableToProtectAPDU
source: Unable To Protect APDU
ar: غير قادر على حماية APDU
fr: Impossible de protéger l'APDU
ru: Невозможно защитить APDU

# NFCDisplayMessageStrings_UnableToUnprotectAPDU
source: Unable To Unprotect APDU
ar: تعذر إلغاء حماية APDU
fr: Impossible de déprotéger l'APDU
ru: Невозможно снять защиту APDU
tr: APDU Korunamıyor

# NFCDisplayMessageStrings_UnsupportedDataGroup
source: Unsupported Data Group
ar: مجموعة البيانات غير مدعومة
fr: Groupe de données non pris en charge
ru: Неподдерживаемая группа данных
tr: Desteklenmeyen Veri Grubu

# NFCDisplayMessageStrings_DataGroupNotRead
source: Data Group Not Read
ar: مجموعة البيانات غير مقروءة
ru: Группа данных не прочитана
tr: Veri Grubu Okunmadı

# NFCDisplayMessageStrings_UnknownTag
source: Unknown Tag
ar: علامة غير معروفة
fr: Balise inconnue
ru: Неизвестный тег
tr: Bilinmeyen Etiket

# NFCDisplayMessageStrings_UnknownImageFormat
source: Unknown Image Format
ar: تنسيق صورة غير معروف
fr: Format d'image inconnu
ru: Неизвестный формат изображения
tr: Bilinmeyen Görüntü Biçimi

# NFCDisplayMessageStrings_NotImplemented
source: Not Implemented
ar: لم يتم التنفيذ
fr: Pas mis en œuvre
ru: Не реализована
tr: Uygulanmadı

# NFCDisplayMessageStrings_TagNotValid
source: Tag Not Valid
ar: العلامة غير صالحة
fr: Balise non valide
ru: Тег недействителен
tr: Etiket Geçerli Değil

# NFCDisplayMessageStrings_ConnectionEr
source: Connection Error
ar: خطأ في الإتصال
fr: Erreur de connexion
ru: Ошибка подключения
tr: Bağlantı hatası

# NFCDisplayMessageStrings_UserCanceled
source: User Canceled
ar: تم إلغاء المستخدم
fr: Utilisateur annulé
ru: Пользователь отменен
tr: Kullanıcı İptal Edildi

# NFCDisplayMessageStrings_InvalidMRZKey
source: Invalid MRZ Key
ar: مفتاح MRZ غير صالح
fr: Clé MRZ invalide
ru: Неверный ключ MRZ
tr: Geçersiz MRZ Anahtarı

# NFCDisplayMessageStrings_MoreThanOneTagFound
source: More Than One Tag Found
ar: تم العثور علىأكثر من علامة واحدة
fr: Plus d'une balise trouvée
ru: Найдено более одного тега
tr: Birden Fazla Etiket Bulundu

# NFCDisplayMessageStrings_InvalidHashAlgorithmSpecified
source: Invalid Hash Algorithm Specified
ar: تم تحديد خوارزمية تجزئة غير صالحة
fr: Algorithme de hachage spécifié invalide
ru: Указан недопустимый алгоритм хэширования
tr: Geçersiz Hash Algoritması Belirtildi

# NFCDisplayMessageStrings_UnsupportedCipherAlgorithm
source: Unsupported Cipher Algorithm
ar: خوارزمية التشفير غير مدعومة
fr: Algorithme de chiffrement non pris en charge
ru: Неподдерживаемый алгоритм шифрования
tr: Desteklenmeyen Şifreleme Algoritması

# NFCDisplayMessageStrings_UnsupportedMappingType
source: Unsupported Mapping Type
ar: نوع التعيين غير مدعوم
fr: Type de mappage non pris en charge
ru: Неподдерживаемый тип отображения
tr: Desteklenmeyen Eşleme Türü

# NFCDisplayMessageStrings_PACEError
source: PACE Error
ar: خطأ في PACE
fr: Erreur PACE
ru: Ошибка PACE
tr: PACE Hatası

# NFCDisplayMessageStrings_ChipAuthenticationFailed
source: Chip Authentication Failed
ar: فشلت مصادقة الشريحة
fr: Échec de l'authentification de la puce
ru: Ошибка аутентификации чипа
tr: Çip Kimlik Doğrulaması Başarısız

# NFCDisplayMessageStrings_InvalidDataPassed
source: Invalid Data Passed
ar: تم تمرير بيانات غير صالحة
fr: Données invalides transmises
ru: Переданы недопустимые данные
tr: Geçersiz Veri Aktarıldı

# NFCDisplayMessageStrings_NotYetSupported
source: Not Yet Supported
ar: غير مدعوم حتى الآن
fr: Pas encore pris en charge
ru: Пока не поддерживается
tr: Henüz Desteklenmiyor

# NFCDisplayMessageStrings_SecurityStatusNotSatisfied
source: Security status not satisfied
ar: حالة الأمان غير راضية
fr: Статус безопасности не удовлетворен
tr: Güvenlik durumu tatmin edici değil

# NFCDisplayMessageStrings_SessionInvalidated
source: Session Invalidated
ar: تم إلغاء الجلسة
fr: Session invalidée
ru: Сессия недействительна
tr: Oturum Geçersiz Kılındı

# NFCDisplayMessageStrings_ClassNotSupported
source: Class Not Supported
ar: فئة غير مدعومة
fr: Classe non prise en charge
ru: Класс не поддерживается
tr: Sınıf Desteklenmiyor

# NFCDisplayMessageStrings_TagConnectionLost
source: Tag Connection Lost
ar: تم فقد اتصال العلامة
fr: Connexion de balise perdue
ru: Соединение с тегом потеряно
tr: Etiket Bağlantısı Kesildi
